In [1]:
import pandas as pd

url='https://drive.google.com/u/0/uc?id=1oln2ri6nu1wDQfT3gQMLLNlmQ2h6B9d9&export=download'
df=pd.read_csv(url)

In [8]:
df.head(2)

,Transaction Code,Value,Customer Code,Online or In-Person,Transaction Date
0,DTB-716-679-576,1448,100001,2,20/03/2023 00:00:00
1,DS-795-814-303,7839,100001,2,15/11/2023 00:00:00

In [7]:
df.dtypes

Transaction Code       object
Value                   int64
Customer Code           int64
Online or In-Person     int64
Transaction Date       object
dtype: object

In [10]:
df[['Bank','Transaction Code']]=df['Transaction Code'].str.split('-',n=1,expand=True)

In [12]:
df.head(2)

,Transaction Code,Value,Customer Code,Online or In-Person,Transaction Date,Bank
0,716-679-576,1448,100001,2,20/03/2023 00:00:00,DTB
1,795-814-303,7839,100001,2,15/11/2023 00:00:00,DS

In [16]:
df=df[['Transaction Code','Bank','Value','Customer Code','Online or In-Person','Transaction Date']]

In [17]:
df.head(2)

,Transaction Code,Bank,Value,Customer Code,Online or In-Person,Transaction Date
0,716-679-576,DTB,1448,100001,2,20/03/2023 00:00:00
1,795-814-303,DS,7839,100001,2,15/11/2023 00:00:00

In [18]:
df['Online or In-Person']=df['Online or In-Person'].replace({1:'Online',2:'In-Person'})

In [20]:
df.head(2)

,Transaction Code,Bank,Value,Customer Code,Online or In-Person,Transaction Date
0,716-679-576,DTB,1448,100001,In-Person,20/03/2023 00:00:00
1,795-814-303,DS,7839,100001,In-Person,15/11/2023 00:00:00

In [23]:
df['Transaction Date']=pd.to_datetime(df['Transaction Date'])

C:\Users\gioe1\AppData\Local\Temp\ipykernel_9664\204886444.py:1: UserWarning: Parsing dates in %d/%m/%Y %H:%M:%S format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['Transaction Date']=pd.to_datetime(df['Transaction Date'])

In [24]:
df.dtypes

Transaction Code               object
Bank                           object
Value                           int64
Customer Code                   int64
Online or In-Person            object
Transaction Date       datetime64[ns]
dtype: object

In [28]:
df['Transaction Date']=df['Transaction Date'].dt.strftime('%A')

In [29]:
df.head(2)

,Transaction Code,Bank,Value,Customer Code,Online or In-Person,Transaction Date
0,716-679-576,DTB,1448,100001,In-Person,Monday
1,795-814-303,DS,7839,100001,In-Person,Wednesday

In [38]:
transaction_table=df
by_bank=df.groupby(['Bank'])['Value'].sum()
by_3_properties=df.groupby(['Bank','Online or In-Person','Transaction Date'])['Value'].sum()
by_2_properties=df.groupby(['Bank','Customer Code'])['Value'].sum()
print(by_2_properties)

by_bank.to_csv('delete_by_bank')
by_3_properties.to_csv('delete_by_3_properties')
by_2_properties.to_csv('delete_by_2_properties')

Bank  Customer Code
DS    100000           57909
      100001           53063
      100002           69803
      100003           25482
      100004           63315
      100005           39668
      100006           77636
      100007           76190
      100008           56400
      100009           56581
      100010           77893
DSB   100000           27585
      100001           67856
      100002           27936
      100003           58154
      100004           39003
      100005           56396
      100006           32333
      100007           29702
      100008           47121
      100009           51749
      100010           92654
DTB   100000           77252
      100001           60675
      100002           48616
      100003           84574
      100004           44435
      100005           37795
      100006           41909
      100007           29308
      100008           69352
      100009           52926
      100010           71396
Name: Value, dtype: int64